src/mac_unload_swap.org
#+begin_src shell
// 查看当前使用情况 
$ sysctl vm.swapusage
vm.swapusage: total = 1024.00M  used = 354.50M  free = 669.50M  (encrypted)

// 关闭虚拟内存
$ sudo launchctl unload -w /System/Library/LaunchDaemons/com.apple.dynamic_pager.plist
$ sudo rm /private/var/vm/swapfile*

// 重新开启虚拟内存 
$ sudo launchctl load -w /System/Library/LaunchDaemons/com.apple.dynamic_pager.plist
#+end_src

修改 swap 的 compressor mode

https://medium.com/@ayltai/need-for-speed-how-to-squeeze-every-last-drop-out-of-macos-sierra-7ac17b680c98
