blog/mac_unload_swap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" href="https://jgkamat.gitlab.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<div class="org-src-container">
<pre class="src src-shell">// &#26597;&#30475;&#24403;&#21069;&#20351;&#29992;&#24773;&#20917; 
$ sysctl vm.swapusage
vm.swapusage: <span style="color: #DFAF8F;">total</span> = <span style="color: #BFEBBF;">1024.00M</span>  <span style="color: #DFAF8F;">used</span> = <span style="color: #BFEBBF;">354.50M</span>  <span style="color: #DFAF8F;">free</span> = <span style="color: #BFEBBF;">669.50M</span>  (encrypted)

// &#20851;&#38381;&#34394;&#25311;&#20869;&#23384;
$ sudo launchctl unload -w /System/Library/LaunchDaemons/com.apple.dynamic_pager.plist
$ sudo rm /private/var/vm/swapfile*

// &#37325;&#26032;&#24320;&#21551;&#34394;&#25311;&#20869;&#23384; 
$ sudo launchctl load -w /System/Library/LaunchDaemons/com.apple.dynamic_pager.plist
</pre>
</div>

<p>
修改 swap 的 compressor mode
</p>

<p>
<a href="https://medium.com/@ayltai/need-for-speed-how-to-squeeze-every-last-drop-out-of-macos-sierra-7ac17b680c98">https://medium.com/@ayltai/need-for-speed-how-to-squeeze-every-last-drop-out-of-macos-sierra-7ac17b680c98</a>
</p>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.3.1)</p>
</div>
</div>
</body>
</html>
